> (My next step will be to run the plain vanilla Fargate example from 14.0.0 and see if it also exhibits the problem. I'm assuming it won't because you'd have seen it yourself in that case.)

It didn't work; same error.

<details>
  <summary>Fargate example fails with module v14.0.0 and Terraform 0.12.31</summary>
  
```
bmogilefsky@rocinante-w10:~/Documents/Code/eks-brokerpak/terraform/provision$ mkdir test
bmogilefsky@rocinante-w10:~/Documents/Code/eks-brokerpak/terraform/provision$ cd test
bmogilefsky@rocinante-w10:~/Documents/Code/eks-brokerpak/terraform/provision/test$ curl -L --output 14.zip https://github.com/terraform-aws-modules/terraform-aws-eks/archive/refs/tags/v14.0.0.zip
  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current
                                 Dload  Upload   Total   Spent    Left  Speed
100   155  100   155    0     0    979      0 --:--:-- --:--:-- --:--:--   981
100  103k    0  103k    0     0   185k      0 --:--:-- --:--:-- --:--:-- 11.2M
bmogilefsky@rocinante-w10:~/Documents/Code/eks-brokerpak/terraform/provision/test$ unzip 14.zip
Archive:  14.zip
a26c9fd0c9c880d5b99c438ad620e91dda957e10
   creating: terraform-aws-eks-14.0.0/
   creating: terraform-aws-eks-14.0.0/.chglog/
  inflating: terraform-aws-eks-14.0.0/.chglog/CHANGELOG.tpl.md  
  inflating: terraform-aws-eks-14.0.0/.chglog/config.yml  
  inflating: terraform-aws-eks-14.0.0/.editorconfig  
   creating: terraform-aws-eks-14.0.0/.github/
  inflating: terraform-aws-eks-14.0.0/.github/CONTRIBUTING.md  
  inflating: terraform-aws-eks-14.0.0/.github/ISSUE_TEMPLATE.md  
  inflating: terraform-aws-eks-14.0.0/.github/PULL_REQUEST_TEMPLATE.md  
  inflating: terraform-aws-eks-14.0.0/.github/semantic.yml  
  inflating: terraform-aws-eks-14.0.0/.github/stale.yml  
   creating: terraform-aws-eks-14.0.0/.github/workflows/
  inflating: terraform-aws-eks-14.0.0/.github/workflows/changelog-check.yaml  
  inflating: terraform-aws-eks-14.0.0/.github/workflows/lint.yml  
  inflating: terraform-aws-eks-14.0.0/.gitignore  
  inflating: terraform-aws-eks-14.0.0/.pre-commit-config.yaml  
  inflating: terraform-aws-eks-14.0.0/CHANGELOG.md  
  inflating: terraform-aws-eks-14.0.0/CHANGELOG.pre-v11.0.0.md  
  inflating: terraform-aws-eks-14.0.0/LICENSE  
  inflating: terraform-aws-eks-14.0.0/Makefile  
  inflating: terraform-aws-eks-14.0.0/README.md  
  inflating: terraform-aws-eks-14.0.0/aws_auth.tf  
  inflating: terraform-aws-eks-14.0.0/cluster.tf  
  inflating: terraform-aws-eks-14.0.0/data.tf  
   creating: terraform-aws-eks-14.0.0/docs/
  inflating: terraform-aws-eks-14.0.0/docs/autoscaling.md  
  inflating: terraform-aws-eks-14.0.0/docs/enable-docker-bridge-network.md  
  inflating: terraform-aws-eks-14.0.0/docs/faq.md  
  inflating: terraform-aws-eks-14.0.0/docs/iam-permissions.md  
  inflating: terraform-aws-eks-14.0.0/docs/spot-instances.md  
   creating: terraform-aws-eks-14.0.0/examples/
  inflating: terraform-aws-eks-14.0.0/examples/README.md  
   creating: terraform-aws-eks-14.0.0/examples/basic/
  inflating: terraform-aws-eks-14.0.0/examples/basic/main.tf  
  inflating: terraform-aws-eks-14.0.0/examples/basic/outputs.tf  
  inflating: terraform-aws-eks-14.0.0/examples/basic/variables.tf  
   creating: terraform-aws-eks-14.0.0/examples/create_false/
  inflating: terraform-aws-eks-14.0.0/examples/create_false/main.tf  
 extracting: terraform-aws-eks-14.0.0/examples/create_false/variables.tf  
   creating: terraform-aws-eks-14.0.0/examples/fargate/
  inflating: terraform-aws-eks-14.0.0/examples/fargate/main.tf  
  inflating: terraform-aws-eks-14.0.0/examples/fargate/outputs.tf  
  inflating: terraform-aws-eks-14.0.0/examples/fargate/variables.tf  
   creating: terraform-aws-eks-14.0.0/examples/irsa/
  inflating: terraform-aws-eks-14.0.0/examples/irsa/README.md  
  inflating: terraform-aws-eks-14.0.0/examples/irsa/cluster-autoscaler-chart-values.yaml  
  inflating: terraform-aws-eks-14.0.0/examples/irsa/irsa.tf  
  inflating: terraform-aws-eks-14.0.0/examples/irsa/locals.tf  
  inflating: terraform-aws-eks-14.0.0/examples/irsa/main.tf  
  inflating: terraform-aws-eks-14.0.0/examples/irsa/outputs.tf  
 extracting: terraform-aws-eks-14.0.0/examples/irsa/variables.tf  
   creating: terraform-aws-eks-14.0.0/examples/launch_templates/
  inflating: terraform-aws-eks-14.0.0/examples/launch_templates/main.tf  
  inflating: terraform-aws-eks-14.0.0/examples/launch_templates/outputs.tf  
 extracting: terraform-aws-eks-14.0.0/examples/launch_templates/pre_userdata.sh  
 extracting: terraform-aws-eks-14.0.0/examples/launch_templates/variables.tf  
   creating: terraform-aws-eks-14.0.0/examples/launch_templates_with_managed_node_groups/
  inflating: terraform-aws-eks-14.0.0/examples/launch_templates_with_managed_node_groups/disk_encryption_policy.tf  
  inflating: terraform-aws-eks-14.0.0/examples/launch_templates_with_managed_node_groups/launchtemplate.tf  
  inflating: terraform-aws-eks-14.0.0/examples/launch_templates_with_managed_node_groups/main.tf  
   creating: terraform-aws-eks-14.0.0/examples/launch_templates_with_managed_node_groups/templates/
  inflating: terraform-aws-eks-14.0.0/examples/launch_templates_with_managed_node_groups/templates/userdata.sh.tpl  
  inflating: terraform-aws-eks-14.0.0/examples/launch_templates_with_managed_node_groups/variables.tf  
   creating: terraform-aws-eks-14.0.0/examples/managed_node_groups/
  inflating: terraform-aws-eks-14.0.0/examples/managed_node_groups/main.tf  
  inflating: terraform-aws-eks-14.0.0/examples/managed_node_groups/outputs.tf  
  inflating: terraform-aws-eks-14.0.0/examples/managed_node_groups/variables.tf  
   creating: terraform-aws-eks-14.0.0/examples/secrets_encryption/
  inflating: terraform-aws-eks-14.0.0/examples/secrets_encryption/main.tf  
  inflating: terraform-aws-eks-14.0.0/examples/secrets_encryption/outputs.tf  
  inflating: terraform-aws-eks-14.0.0/examples/secrets_encryption/variables.tf  
   creating: terraform-aws-eks-14.0.0/examples/spot_instances/
  inflating: terraform-aws-eks-14.0.0/examples/spot_instances/main.tf  
  inflating: terraform-aws-eks-14.0.0/examples/spot_instances/outputs.tf  
 extracting: terraform-aws-eks-14.0.0/examples/spot_instances/variables.tf  
  inflating: terraform-aws-eks-14.0.0/fargate.tf  
  inflating: terraform-aws-eks-14.0.0/irsa.tf  
  inflating: terraform-aws-eks-14.0.0/kubectl.tf  
  inflating: terraform-aws-eks-14.0.0/local.tf  
   creating: terraform-aws-eks-14.0.0/modules/
   creating: terraform-aws-eks-14.0.0/modules/fargate/
  inflating: terraform-aws-eks-14.0.0/modules/fargate/README.md  
  inflating: terraform-aws-eks-14.0.0/modules/fargate/data.tf  
  inflating: terraform-aws-eks-14.0.0/modules/fargate/fargate.tf  
  inflating: terraform-aws-eks-14.0.0/modules/fargate/locals.tf  
  inflating: terraform-aws-eks-14.0.0/modules/fargate/outputs.tf  
  inflating: terraform-aws-eks-14.0.0/modules/fargate/variables.tf  
   creating: terraform-aws-eks-14.0.0/modules/node_groups/
  inflating: terraform-aws-eks-14.0.0/modules/node_groups/README.md  
  inflating: terraform-aws-eks-14.0.0/modules/node_groups/locals.tf  
  inflating: terraform-aws-eks-14.0.0/modules/node_groups/node_groups.tf  
  inflating: terraform-aws-eks-14.0.0/modules/node_groups/outputs.tf  
  inflating: terraform-aws-eks-14.0.0/modules/node_groups/random.tf  
  inflating: terraform-aws-eks-14.0.0/modules/node_groups/variables.tf  
  inflating: terraform-aws-eks-14.0.0/node_groups.tf  
  inflating: terraform-aws-eks-14.0.0/outputs.tf  
   creating: terraform-aws-eks-14.0.0/templates/
  inflating: terraform-aws-eks-14.0.0/templates/kubeconfig.tpl  
  inflating: terraform-aws-eks-14.0.0/templates/userdata.sh.tpl  
  inflating: terraform-aws-eks-14.0.0/templates/userdata_windows.tpl  
   creating: terraform-aws-eks-14.0.0/tools/
  inflating: terraform-aws-eks-14.0.0/tools/semtag  
  inflating: terraform-aws-eks-14.0.0/variables.tf  
  inflating: terraform-aws-eks-14.0.0/versions.tf  
  inflating: terraform-aws-eks-14.0.0/workers.tf  
  inflating: terraform-aws-eks-14.0.0/workers_launch_template.tf  
bmogilefsky@rocinante-w10:~/Documents/Code/eks-brokerpak/terraform/provision/test$ cd terraform-aws-eks-14.0.0/examples/fargate/
bmogilefsky@rocinante-w10:~/Documents/Code/eks-brokerpak/terraform/provision/test/terraform-aws-eks-14.0.0/examples/fargate$ terraform init
Initializing modules...
- eks in ../..
- eks.fargate in ../../modules/fargate
- eks.node_groups in ../../modules/node_groups
Downloading terraform-aws-modules/vpc/aws 2.47.0 for vpc...
- vpc in .terraform/modules/vpc

Initializing the backend...

Initializing provider plugins...
- Checking for available provider plugins...
- Downloading plugin for provider "template" (hashicorp/template) 2.2.0...
- Downloading plugin for provider "kubernetes" (hashicorp/kubernetes) 1.13.4...
- Downloading plugin for provider "aws" (hashicorp/aws) 3.61.0...
- Downloading plugin for provider "random" (hashicorp/random) 2.3.1...
- Downloading plugin for provider "local" (hashicorp/local) 1.4.0...
- Downloading plugin for provider "null" (hashicorp/null) 2.1.2...

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
bmogilefsky@rocinante-w10:~/Documents/Code/eks-brokerpak/terraform/provision/test/terraform-aws-eks-14.0.0/examples/fargate$ terraform version
Terraform v0.12.31
+ provider.aws v3.61.0
+ provider.kubernetes v1.13.4
+ provider.local v1.4.0
+ provider.null v2.1.2
+ provider.random v2.3.1
+ provider.template v2.2.0

Your version of Terraform is out of date! The latest version
is 1.0.8. You can update by downloading from https://www.terraform.io/downloads.html
bmogilefsky@rocinante-w10:~/Documents/Code/eks-brokerpak/terraform/provision/test/terraform-aws-eks-14.0.0/examples/fargate$ terraform apply -auto-approve
module.eks.data.aws_ami.eks_worker_windows: Refreshing state...
module.eks.data.aws_iam_policy_document.cluster_elb_sl_role_creation[0]: Refreshing state...
module.eks.data.aws_partition.current: Refreshing state...
module.eks.data.aws_caller_identity.current: Refreshing state...
data.aws_availability_zones.available: Refreshing state...
module.eks.module.fargate.data.aws_iam_policy_document.eks_fargate_pod_assume_role[0]: Refreshing state...
module.eks.data.aws_ami.eks_worker: Refreshing state...
module.eks.data.aws_iam_policy_document.cluster_assume_role_policy: Refreshing state...
module.eks.data.aws_iam_policy_document.workers_assume_role_policy: Refreshing state...
random_string.suffix: Creating...
random_string.suffix: Creation complete after 0s [id=o7loEcDe]
module.eks.aws_iam_role.cluster[0]: Creating...
module.eks.aws_iam_policy.cluster_elb_sl_role_creation[0]: Creating...
module.vpc.aws_vpc.this[0]: Creating...
module.vpc.aws_eip.nat[0]: Creating...
module.vpc.aws_eip.nat[0]: Creation complete after 1s [id=eipalloc-067fc8d15060026c3]
module.eks.aws_iam_policy.cluster_elb_sl_role_creation[0]: Creation complete after 2s [id=arn:aws:iam::645945852371:policy/test-eks-o7loEcDe-elb-sl-role-creation20211002035435707900000002]
module.eks.aws_iam_role.cluster[0]: Creation complete after 2s [id=test-eks-o7loEcDe20211002035435702100000001]
module.eks.aws_iam_role_policy_attachment.cluster_elb_sl_role_creation[0]: Creating...
module.eks.aws_iam_role_policy_attachment.cluster_AmazonEKSClusterPolicy[0]: Creating...
module.eks.aws_iam_role_policy_attachment.cluster_AmazonEKSVPCResourceControllerPolicy[0]: Creating...
module.eks.aws_iam_role_policy_attachment.cluster_AmazonEKSServicePolicy[0]: Creating...
module.eks.aws_iam_role_policy_attachment.cluster_AmazonEKSServicePolicy[0]: Creation complete after 1s [id=test-eks-o7loEcDe20211002035435702100000001-20211002035438691200000004]
module.eks.aws_iam_role_policy_attachment.cluster_AmazonEKSClusterPolicy[0]: Creation complete after 1s [id=test-eks-o7loEcDe20211002035435702100000001-20211002035438998100000006]
module.eks.aws_iam_role_policy_attachment.cluster_AmazonEKSVPCResourceControllerPolicy[0]: Creation complete after 1s [id=test-eks-o7loEcDe20211002035435702100000001-20211002035438678100000003]
module.eks.aws_iam_role_policy_attachment.cluster_elb_sl_role_creation[0]: Creation complete after 2s [id=test-eks-o7loEcDe20211002035435702100000001-20211002035438858200000005]
module.vpc.aws_vpc.this[0]: Still creating... [10s elapsed]
module.vpc.aws_vpc.this[0]: Creation complete after 14s [id=vpc-024c1e702d94b5fa0]
module.vpc.aws_route_table.public[0]: Creating...
module.vpc.aws_subnet.private[0]: Creating...
module.vpc.aws_internet_gateway.this[0]: Creating...
module.vpc.aws_subnet.public[1]: Creating...
module.vpc.aws_subnet.public[2]: Creating...
module.vpc.aws_subnet.private[1]: Creating...
module.vpc.aws_subnet.public[0]: Creating...
module.vpc.aws_route_table.private[0]: Creating...
module.eks.aws_security_group.workers[0]: Creating...
module.eks.aws_security_group.cluster[0]: Creating...
module.vpc.aws_route_table.public[0]: Creation complete after 1s [id=rtb-06999aa979329ecd4]
module.vpc.aws_subnet.private[2]: Creating...
module.vpc.aws_route_table.private[0]: Creation complete after 1s [id=rtb-08cbf14443df5c265]
module.vpc.aws_internet_gateway.this[0]: Creation complete after 1s [id=igw-0c7443317e9e63c3a]
module.vpc.aws_route.public_internet_gateway[0]: Creating...
module.vpc.aws_subnet.private[1]: Creation complete after 1s [id=subnet-0569b8b7f2686dca7]
module.vpc.aws_subnet.private[0]: Creation complete after 2s [id=subnet-0bb04f29f62328f28]
module.vpc.aws_subnet.private[2]: Creation complete after 1s [id=subnet-0e28cdf5cedb897a8]
module.vpc.aws_route_table_association.private[2]: Creating...
module.vpc.aws_route_table_association.private[1]: Creating...
module.vpc.aws_route_table_association.private[0]: Creating...
module.eks.aws_security_group.workers[0]: Creation complete after 2s [id=sg-0b24b1657c25ce0be]
module.eks.aws_security_group_rule.workers_egress_internet[0]: Creating...
module.eks.aws_security_group_rule.workers_ingress_self[0]: Creating...
module.eks.aws_security_group.cluster[0]: Creation complete after 2s [id=sg-0c25a83b5810f5f57]
module.eks.aws_security_group_rule.cluster_egress_internet[0]: Creating...
module.vpc.aws_route.public_internet_gateway[0]: Creation complete after 2s [id=r-rtb-06999aa979329ecd41080289494]
module.eks.aws_security_group_rule.cluster_https_worker_ingress[0]: Creating...
module.vpc.aws_route_table_association.private[0]: Creation complete after 1s [id=rtbassoc-013ade548e9931f0f]
module.eks.aws_security_group_rule.workers_ingress_cluster[0]: Creating...
module.vpc.aws_route_table_association.private[1]: Creation complete after 1s [id=rtbassoc-0394a060aec07570b]
module.eks.aws_security_group_rule.workers_ingress_cluster_https[0]: Creating...
module.eks.aws_security_group_rule.workers_egress_internet[0]: Creation complete after 2s [id=sgrule-1107814152]
module.eks.aws_security_group_rule.cluster_egress_internet[0]: Creation complete after 2s [id=sgrule-98002231]
module.vpc.aws_route_table_association.private[2]: Creation complete after 2s [id=rtbassoc-0a60d591376bf94fc]
module.eks.aws_security_group_rule.workers_ingress_self[0]: Creation complete after 3s [id=sgrule-310041333]
module.eks.aws_security_group_rule.cluster_https_worker_ingress[0]: Creation complete after 2s [id=sgrule-3879160355]
module.eks.aws_eks_cluster.this[0]: Creating...
module.eks.aws_security_group_rule.workers_ingress_cluster[0]: Creation complete after 3s [id=sgrule-454843698]
module.eks.aws_security_group_rule.workers_ingress_cluster_https[0]: Creation complete after 4s [id=sgrule-1717874363]
module.vpc.aws_subnet.public[2]: Still creating... [10s elapsed]
module.vpc.aws_subnet.public[1]: Still creating... [10s elapsed]
module.vpc.aws_subnet.public[0]: Still creating... [10s elapsed]
module.vpc.aws_subnet.public[0]: Creation complete after 12s [id=subnet-0ee0d3df62c083fab]
module.vpc.aws_subnet.public[1]: Creation complete after 12s [id=subnet-0af8bdc04ca49e2f1]
module.vpc.aws_subnet.public[2]: Creation complete after 12s [id=subnet-08cf48761c964c0b5]
module.vpc.aws_route_table_association.public[2]: Creating...
module.vpc.aws_route_table_association.public[1]: Creating...
module.vpc.aws_route_table_association.public[0]: Creating...
module.vpc.aws_nat_gateway.this[0]: Creating...
module.vpc.aws_route_table_association.public[1]: Creation complete after 1s [id=rtbassoc-0f87c13624f4afea9]
module.vpc.aws_route_table_association.public[0]: Creation complete after 1s [id=rtbassoc-02a2990160573f26e]
module.vpc.aws_route_table_association.public[2]: Creation complete after 1s [id=rtbassoc-0f880bd7cd526cc15]
module.eks.aws_eks_cluster.this[0]: Still creating... [10s elapsed]
module.vpc.aws_nat_gateway.this[0]: Still creating... [10s elapsed]
module.eks.aws_eks_cluster.this[0]: Still creating... [20s elapsed]
module.vpc.aws_nat_gateway.this[0]: Still creating... [20s elapsed]
module.eks.aws_eks_cluster.this[0]: Still creating... [30s elapsed]
module.vpc.aws_nat_gateway.this[0]: Still creating... [30s elapsed]
module.eks.aws_eks_cluster.this[0]: Still creating... [40s elapsed]
module.vpc.aws_nat_gateway.this[0]: Still creating... [40s elapsed]
module.eks.aws_eks_cluster.this[0]: Still creating... [50s elapsed]
module.vpc.aws_nat_gateway.this[0]: Still creating... [50s elapsed]
module.eks.aws_eks_cluster.this[0]: Still creating... [1m0s elapsed]
module.vpc.aws_nat_gateway.this[0]: Still creating... [1m0s elapsed]
module.eks.aws_eks_cluster.this[0]: Still creating... [1m10s elapsed]
module.vpc.aws_nat_gateway.this[0]: Still creating... [1m10s elapsed]
module.eks.aws_eks_cluster.this[0]: Still creating... [1m20s elapsed]
module.vpc.aws_nat_gateway.this[0]: Still creating... [1m20s elapsed]
module.eks.aws_eks_cluster.this[0]: Still creating... [1m30s elapsed]
module.vpc.aws_nat_gateway.this[0]: Still creating... [1m30s elapsed]
module.eks.aws_eks_cluster.this[0]: Still creating... [1m40s elapsed]
module.vpc.aws_nat_gateway.this[0]: Creation complete after 1m38s [id=nat-0a5ad736e6a5f439d]
module.vpc.aws_route.private_nat_gateway[0]: Creating...
module.vpc.aws_route.private_nat_gateway[0]: Creation complete after 1s [id=r-rtb-08cbf14443df5c2651080289494]
module.eks.aws_eks_cluster.this[0]: Still creating... [1m50s elapsed]
module.eks.aws_eks_cluster.this[0]: Still creating... [2m0s elapsed]
module.eks.aws_eks_cluster.this[0]: Still creating... [2m10s elapsed]
module.eks.aws_eks_cluster.this[0]: Still creating... [2m20s elapsed]
module.eks.aws_eks_cluster.this[0]: Still creating... [2m30s elapsed]
module.eks.aws_eks_cluster.this[0]: Still creating... [2m40s elapsed]
module.eks.aws_eks_cluster.this[0]: Still creating... [2m50s elapsed]

Error: error creating EKS Cluster (test-eks-o7loEcDe): ResourceInUseException: Cluster already exists with name: test-eks-o7loEcDe
{
  RespMetadata: {
    StatusCode: 409,
    RequestID: "c438594d-5d9a-4f26-8991-42f2514f410c"
  },
  ClusterName: "test-eks-o7loEcDe",
  Message_: "Cluster already exists with name: test-eks-o7loEcDe"
}

  on ../../cluster.tf line 9, in resource "aws_eks_cluster" "this":
   9: resource "aws_eks_cluster" "this" {
```
</details>

I also tried it with everything up to date... Terraform, module, providers:

<details>
  <summary>Fargate example fails with module v17.2.0 and Terraform 1.0.8</summary>
  
```
bmogilefsky@rocinante-w10:~/Documents/Code/eks-brokerpak/terraform/provision/test$ curl -L --output 17.zip https://github.com/terraform-aws-modules/terraform-aws-eks/archive/refs/tags/v17.20.0.zip
  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current
                                 Dload  Upload   Total   Spent    Left  Speed
100   156  100   156    0     0    522      0 --:--:-- --:--:-- --:--:--   523
100  131k    0  131k    0     0   182k      0 --:--:-- --:--:-- --:--:--  182k
bmogilefsky@rocinante-w10:~/Documents/Code/eks-brokerpak/terraform/provision/test$ unzip 17.zip
Archive:  17.zip
284b038bfda29800d2203d1fce939204c944fd70
   creating: terraform-aws-eks-17.20.0/
   creating: terraform-aws-eks-17.20.0/.chglog/
  inflating: terraform-aws-eks-17.20.0/.chglog/CHANGELOG.tpl.md  
  inflating: terraform-aws-eks-17.20.0/.chglog/config.yml  
  inflating: terraform-aws-eks-17.20.0/.editorconfig  
   creating: terraform-aws-eks-17.20.0/.github/
  inflating: terraform-aws-eks-17.20.0/.github/CONTRIBUTING.md  
  inflating: terraform-aws-eks-17.20.0/.github/ISSUE_TEMPLATE.md  
  inflating: terraform-aws-eks-17.20.0/.github/PULL_REQUEST_TEMPLATE.md  
  inflating: terraform-aws-eks-17.20.0/.github/semantic.yml  
  inflating: terraform-aws-eks-17.20.0/.github/stale.yml  
   creating: terraform-aws-eks-17.20.0/.github/workflows/
  inflating: terraform-aws-eks-17.20.0/.github/workflows/changelog-check.yaml  
  inflating: terraform-aws-eks-17.20.0/.github/workflows/pre-commit.yml  
  inflating: terraform-aws-eks-17.20.0/.gitignore  
  inflating: terraform-aws-eks-17.20.0/.pre-commit-config.yaml  
  inflating: terraform-aws-eks-17.20.0/CHANGELOG.md  
  inflating: terraform-aws-eks-17.20.0/CHANGELOG.pre-v11.0.0.md  
  inflating: terraform-aws-eks-17.20.0/LICENSE  
  inflating: terraform-aws-eks-17.20.0/Makefile  
  inflating: terraform-aws-eks-17.20.0/README.md  
  inflating: terraform-aws-eks-17.20.0/aws_auth.tf  
  inflating: terraform-aws-eks-17.20.0/data.tf  
   creating: terraform-aws-eks-17.20.0/docs/
  inflating: terraform-aws-eks-17.20.0/docs/autoscaling.md  
  inflating: terraform-aws-eks-17.20.0/docs/enable-docker-bridge-network.md  
  inflating: terraform-aws-eks-17.20.0/docs/faq.md  
  inflating: terraform-aws-eks-17.20.0/docs/iam-permissions.md  
  inflating: terraform-aws-eks-17.20.0/docs/spot-instances.md  
  inflating: terraform-aws-eks-17.20.0/docs/upgrades.md  
   creating: terraform-aws-eks-17.20.0/examples/
   creating: terraform-aws-eks-17.20.0/examples/_bootstrap/
  inflating: terraform-aws-eks-17.20.0/examples/_bootstrap/README.md  
  inflating: terraform-aws-eks-17.20.0/examples/_bootstrap/main.tf  
  inflating: terraform-aws-eks-17.20.0/examples/_bootstrap/outputs.tf  
 extracting: terraform-aws-eks-17.20.0/examples/_bootstrap/variables.tf  
  inflating: terraform-aws-eks-17.20.0/examples/_bootstrap/versions.tf  
   creating: terraform-aws-eks-17.20.0/examples/bottlerocket/
  inflating: terraform-aws-eks-17.20.0/examples/bottlerocket/README.md  
  inflating: terraform-aws-eks-17.20.0/examples/bottlerocket/main.tf  
  inflating: terraform-aws-eks-17.20.0/examples/bottlerocket/outputs.tf  
  inflating: terraform-aws-eks-17.20.0/examples/bottlerocket/userdata.toml  
 extracting: terraform-aws-eks-17.20.0/examples/bottlerocket/variables.tf  
  inflating: terraform-aws-eks-17.20.0/examples/bottlerocket/versions.tf  
   creating: terraform-aws-eks-17.20.0/examples/complete/
  inflating: terraform-aws-eks-17.20.0/examples/complete/README.md  
  inflating: terraform-aws-eks-17.20.0/examples/complete/main.tf  
  inflating: terraform-aws-eks-17.20.0/examples/complete/outputs.tf  
 extracting: terraform-aws-eks-17.20.0/examples/complete/variables.tf  
  inflating: terraform-aws-eks-17.20.0/examples/complete/versions.tf  
   creating: terraform-aws-eks-17.20.0/examples/fargate/
  inflating: terraform-aws-eks-17.20.0/examples/fargate/README.md  
  inflating: terraform-aws-eks-17.20.0/examples/fargate/main.tf  
  inflating: terraform-aws-eks-17.20.0/examples/fargate/outputs.tf  
 extracting: terraform-aws-eks-17.20.0/examples/fargate/variables.tf  
  inflating: terraform-aws-eks-17.20.0/examples/fargate/versions.tf  
   creating: terraform-aws-eks-17.20.0/examples/instance_refresh/
  inflating: terraform-aws-eks-17.20.0/examples/instance_refresh/main.tf  
  inflating: terraform-aws-eks-17.20.0/examples/instance_refresh/outputs.tf  
  inflating: terraform-aws-eks-17.20.0/examples/instance_refresh/variables.tf  
  inflating: terraform-aws-eks-17.20.0/examples/instance_refresh/versions.tf  
   creating: terraform-aws-eks-17.20.0/examples/irsa/
  inflating: terraform-aws-eks-17.20.0/examples/irsa/README.md  
  inflating: terraform-aws-eks-17.20.0/examples/irsa/cluster-autoscaler-chart-values.yaml  
  inflating: terraform-aws-eks-17.20.0/examples/irsa/irsa.tf  
  inflating: terraform-aws-eks-17.20.0/examples/irsa/locals.tf  
  inflating: terraform-aws-eks-17.20.0/examples/irsa/main.tf  
  inflating: terraform-aws-eks-17.20.0/examples/irsa/outputs.tf  
 extracting: terraform-aws-eks-17.20.0/examples/irsa/variables.tf  
  inflating: terraform-aws-eks-17.20.0/examples/irsa/versions.tf  
   creating: terraform-aws-eks-17.20.0/examples/launch_templates/
  inflating: terraform-aws-eks-17.20.0/examples/launch_templates/main.tf  
  inflating: terraform-aws-eks-17.20.0/examples/launch_templates/outputs.tf  
 extracting: terraform-aws-eks-17.20.0/examples/launch_templates/pre_userdata.sh  
 extracting: terraform-aws-eks-17.20.0/examples/launch_templates/variables.tf  
  inflating: terraform-aws-eks-17.20.0/examples/launch_templates/versions.tf  
   creating: terraform-aws-eks-17.20.0/examples/launch_templates_with_managed_node_groups/
  inflating: terraform-aws-eks-17.20.0/examples/launch_templates_with_managed_node_groups/disk_encryption_policy.tf  
  inflating: terraform-aws-eks-17.20.0/examples/launch_templates_with_managed_node_groups/launchtemplate.tf  
  inflating: terraform-aws-eks-17.20.0/examples/launch_templates_with_managed_node_groups/main.tf  
  inflating: terraform-aws-eks-17.20.0/examples/launch_templates_with_managed_node_groups/outputs.tf  
   creating: terraform-aws-eks-17.20.0/examples/launch_templates_with_managed_node_groups/templates/
  inflating: terraform-aws-eks-17.20.0/examples/launch_templates_with_managed_node_groups/templates/userdata.sh.tpl  
  inflating: terraform-aws-eks-17.20.0/examples/launch_templates_with_managed_node_groups/variables.tf  
  inflating: terraform-aws-eks-17.20.0/examples/launch_templates_with_managed_node_groups/versions.tf  
   creating: terraform-aws-eks-17.20.0/examples/managed_node_groups/
  inflating: terraform-aws-eks-17.20.0/examples/managed_node_groups/main.tf  
  inflating: terraform-aws-eks-17.20.0/examples/managed_node_groups/outputs.tf  
  inflating: terraform-aws-eks-17.20.0/examples/managed_node_groups/variables.tf  
  inflating: terraform-aws-eks-17.20.0/examples/managed_node_groups/versions.tf  
   creating: terraform-aws-eks-17.20.0/examples/secrets_encryption/
  inflating: terraform-aws-eks-17.20.0/examples/secrets_encryption/main.tf  
  inflating: terraform-aws-eks-17.20.0/examples/secrets_encryption/outputs.tf  
  inflating: terraform-aws-eks-17.20.0/examples/secrets_encryption/variables.tf  
  inflating: terraform-aws-eks-17.20.0/examples/secrets_encryption/versions.tf  
  inflating: terraform-aws-eks-17.20.0/fargate.tf  
  inflating: terraform-aws-eks-17.20.0/irsa.tf  
  inflating: terraform-aws-eks-17.20.0/kubectl.tf  
  inflating: terraform-aws-eks-17.20.0/locals.tf  
  inflating: terraform-aws-eks-17.20.0/main.tf  
   creating: terraform-aws-eks-17.20.0/modules/
   creating: terraform-aws-eks-17.20.0/modules/fargate/
  inflating: terraform-aws-eks-17.20.0/modules/fargate/README.md  
  inflating: terraform-aws-eks-17.20.0/modules/fargate/main.tf  
  inflating: terraform-aws-eks-17.20.0/modules/fargate/outputs.tf  
  inflating: terraform-aws-eks-17.20.0/modules/fargate/variables.tf  
  inflating: terraform-aws-eks-17.20.0/modules/fargate/versions.tf  
   creating: terraform-aws-eks-17.20.0/modules/node_groups/
  inflating: terraform-aws-eks-17.20.0/modules/node_groups/README.md  
  inflating: terraform-aws-eks-17.20.0/modules/node_groups/launch_template.tf  
  inflating: terraform-aws-eks-17.20.0/modules/node_groups/locals.tf  
  inflating: terraform-aws-eks-17.20.0/modules/node_groups/main.tf  
  inflating: terraform-aws-eks-17.20.0/modules/node_groups/outputs.tf  
   creating: terraform-aws-eks-17.20.0/modules/node_groups/templates/
  inflating: terraform-aws-eks-17.20.0/modules/node_groups/templates/userdata.sh.tpl  
  inflating: terraform-aws-eks-17.20.0/modules/node_groups/variables.tf  
  inflating: terraform-aws-eks-17.20.0/modules/node_groups/versions.tf  
  inflating: terraform-aws-eks-17.20.0/node_groups.tf  
  inflating: terraform-aws-eks-17.20.0/outputs.tf  
   creating: terraform-aws-eks-17.20.0/templates/
  inflating: terraform-aws-eks-17.20.0/templates/kubeconfig.tpl  
  inflating: terraform-aws-eks-17.20.0/templates/userdata.sh.tpl  
  inflating: terraform-aws-eks-17.20.0/templates/userdata_windows.tpl  
   creating: terraform-aws-eks-17.20.0/tools/
  inflating: terraform-aws-eks-17.20.0/tools/semtag  
  inflating: terraform-aws-eks-17.20.0/variables.tf  
  inflating: terraform-aws-eks-17.20.0/versions.tf  
  inflating: terraform-aws-eks-17.20.0/workers.tf  
  inflating: terraform-aws-eks-17.20.0/workers_launch_template.tf  
bmogilefsky@rocinante-w10:~/Documents/Code/eks-brokerpak/terraform/provision/test$ cd terraform-aws-eks-17.20.0/examples/_bootstrap/
bmogilefsky@rocinante-w10:~/Documents/Code/eks-brokerpak/terraform/provision/test/terraform-aws-eks-17.20.0/examples/_bootstrap$ terraform apply
╷
│ Error: Module not installed
│ 
│   on main.tf line 24:
│   24: module "vpc" {
│ 
│ This module is not yet installed. Run "terraform init" to install all modules required by this configuration.
╵
bmogilefsky@rocinante-w10:~/Documents/Code/eks-brokerpak/terraform/provision/test/terraform-aws-eks-17.20.0/examples/_bootstrap$ terraform init
Initializing modules...
Downloading terraform-aws-modules/vpc/aws 3.7.0 for vpc...
- vpc in .terraform/modules/vpc

Initializing the backend...

Initializing provider plugins...
- Finding hashicorp/kubernetes versions matching ">= 1.11.0"...
- Finding hashicorp/aws versions matching ">= 3.22.0, >= 3.38.0"...
- Finding hashicorp/random versions matching ">= 2.1.0"...
- Installing hashicorp/kubernetes v2.5.0...
- Installed hashicorp/kubernetes v2.5.0 (signed by HashiCorp)
- Installing hashicorp/aws v3.61.0...
- Installed hashicorp/aws v3.61.0 (signed by HashiCorp)
- Installing hashicorp/random v3.1.0...
- Installed hashicorp/random v3.1.0 (signed by HashiCorp)

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
bmogilefsky@rocinante-w10:~/Documents/Code/eks-brokerpak/terraform/provision/test/terraform-aws-eks-17.20.0/examples/_bootstrap$ terraform version
Terraform v1.0.8
on linux_amd64
+ provider registry.terraform.io/hashicorp/aws v3.61.0
+ provider registry.terraform.io/hashicorp/kubernetes v2.5.0
+ provider registry.terraform.io/hashicorp/random v3.1.0
bmogilefsky@rocinante-w10:~/Documents/Code/eks-brokerpak/terraform/provision/test/terraform-aws-eks-17.20.0/examples/_bootstrap$ terraform apply -auto-approve

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # random_string.suffix will be created
  + resource "random_string" "suffix" {
      + id          = (known after apply)
      + length      = 8
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + result      = (known after apply)
      + special     = false
      + upper       = true
    }

  # module.vpc.aws_internet_gateway.this[0] will be created
  + resource "aws_internet_gateway" "this" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name" = "bootstrap-example"
        }
      + tags_all = {
          + "Name" = "bootstrap-example"
        }
      + vpc_id   = (known after apply)
    }

  # module.vpc.aws_route.public_internet_gateway[0] will be created
  + resource "aws_route" "public_internet_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.vpc.aws_route_table.private[0] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "bootstrap-example-private-eu-west-1a"
        }
      + tags_all         = {
          + "Name" = "bootstrap-example-private-eu-west-1a"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table.private[1] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "bootstrap-example-private-eu-west-1b"
        }
      + tags_all         = {
          + "Name" = "bootstrap-example-private-eu-west-1b"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table.private[2] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "bootstrap-example-private-eu-west-1c"
        }
      + tags_all         = {
          + "Name" = "bootstrap-example-private-eu-west-1c"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table.public[0] will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "bootstrap-example-public"
        }
      + tags_all         = {
          + "Name" = "bootstrap-example-public"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[0] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[1] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[2] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[0] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[1] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[2] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_subnet.private[0] will be created
  + resource "aws_subnet" "private" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "eu-west-1a"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.0.10.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = (known after apply)
      + tags_all                        = (known after apply)
      + vpc_id                          = (known after apply)
    }

  # module.vpc.aws_subnet.private[1] will be created
  + resource "aws_subnet" "private" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "eu-west-1b"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.0.11.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = (known after apply)
      + tags_all                        = (known after apply)
      + vpc_id                          = (known after apply)
    }

  # module.vpc.aws_subnet.private[2] will be created
  + resource "aws_subnet" "private" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "eu-west-1c"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.0.12.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = (known after apply)
      + tags_all                        = (known after apply)
      + vpc_id                          = (known after apply)
    }

  # module.vpc.aws_subnet.public[0] will be created
  + resource "aws_subnet" "public" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "eu-west-1a"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.0.0.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = true
      + owner_id                        = (known after apply)
      + tags                            = (known after apply)
      + tags_all                        = (known after apply)
      + vpc_id                          = (known after apply)
    }

  # module.vpc.aws_subnet.public[1] will be created
  + resource "aws_subnet" "public" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "eu-west-1b"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.0.1.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = true
      + owner_id                        = (known after apply)
      + tags                            = (known after apply)
      + tags_all                        = (known after apply)
      + vpc_id                          = (known after apply)
    }

  # module.vpc.aws_subnet.public[2] will be created
  + resource "aws_subnet" "public" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "eu-west-1c"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.0.2.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = true
      + owner_id                        = (known after apply)
      + tags                            = (known after apply)
      + tags_all                        = (known after apply)
      + vpc_id                          = (known after apply)
    }

  # module.vpc.aws_vpc.this[0] will be created
  + resource "aws_vpc" "this" {
      + arn                              = (known after apply)
      + assign_generated_ipv6_cidr_block = false
      + cidr_block                       = "10.0.0.0/16"
      + default_network_acl_id           = (known after apply)
      + default_route_table_id           = (known after apply)
      + default_security_group_id        = (known after apply)
      + dhcp_options_id                  = (known after apply)
      + enable_classiclink               = (known after apply)
      + enable_classiclink_dns_support   = (known after apply)
      + enable_dns_hostnames             = true
      + enable_dns_support               = true
      + id                               = (known after apply)
      + instance_tenancy                 = "default"
      + ipv6_association_id              = (known after apply)
      + ipv6_cidr_block                  = (known after apply)
      + main_route_table_id              = (known after apply)
      + owner_id                         = (known after apply)
      + tags                             = {
          + "Name" = "bootstrap-example"
        }
      + tags_all                         = {
          + "Name" = "bootstrap-example"
        }
    }

Plan: 20 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + cluster_name = (known after apply)
  + region       = "eu-west-1"
  + vpc          = {
      + azs                                         = [
          + "eu-west-1a",
          + "eu-west-1b",
          + "eu-west-1c",
        ]
      + cgw_arns                                    = []
      + cgw_ids                                     = []
      + database_internet_gateway_route_id          = ""
      + database_ipv6_egress_route_id               = ""
      + database_nat_gateway_route_ids              = []
      + database_network_acl_arn                    = ""
      + database_network_acl_id                     = ""
      + database_route_table_association_ids        = []
      + database_route_table_ids                    = [
          + (known after apply),
          + (known after apply),
          + (known after apply),
        ]
      + database_subnet_arns                        = []
      + database_subnet_group                       = ""
      + database_subnet_group_name                  = ""
      + database_subnets                            = []
      + database_subnets_cidr_blocks                = []
      + database_subnets_ipv6_cidr_blocks           = []
      + default_network_acl_id                      = (known after apply)
      + default_route_table_id                      = (known after apply)
      + default_security_group_id                   = (known after apply)
      + default_vpc_arn                             = ""
      + default_vpc_cidr_block                      = ""
      + default_vpc_default_network_acl_id          = ""
      + default_vpc_default_route_table_id          = ""
      + default_vpc_default_security_group_id       = ""
      + default_vpc_enable_dns_hostnames            = ""
      + default_vpc_enable_dns_support              = ""
      + default_vpc_id                              = ""
      + default_vpc_instance_tenancy                = ""
      + default_vpc_main_route_table_id             = ""
      + dhcp_options_id                             = ""
      + egress_only_internet_gateway_id             = ""
      + elasticache_network_acl_arn                 = ""
      + elasticache_network_acl_id                  = ""
      + elasticache_route_table_association_ids     = []
      + elasticache_route_table_ids                 = [
          + (known after apply),
          + (known after apply),
          + (known after apply),
        ]
      + elasticache_subnet_arns                     = []
      + elasticache_subnet_group                    = ""
      + elasticache_subnet_group_name               = ""
      + elasticache_subnets                         = []
      + elasticache_subnets_cidr_blocks             = []
      + elasticache_subnets_ipv6_cidr_blocks        = []
      + igw_arn                                     = (known after apply)
      + igw_id                                      = (known after apply)
      + intra_network_acl_arn                       = ""
      + intra_network_acl_id                        = ""
      + intra_route_table_association_ids           = []
      + intra_route_table_ids                       = []
      + intra_subnet_arns                           = []
      + intra_subnets                               = []
      + intra_subnets_cidr_blocks                   = []
      + intra_subnets_ipv6_cidr_blocks              = []
      + name                                        = "bootstrap-example"
      + nat_ids                                     = []
      + nat_public_ips                              = []
      + natgw_ids                                   = []
      + outpost_network_acl_arn                     = ""
      + outpost_network_acl_id                      = ""
      + outpost_subnet_arns                         = []
      + outpost_subnets                             = []
      + outpost_subnets_cidr_blocks                 = []
      + outpost_subnets_ipv6_cidr_blocks            = []
      + private_ipv6_egress_route_ids               = []
      + private_nat_gateway_route_ids               = []
      + private_network_acl_arn                     = ""
      + private_network_acl_id                      = ""
      + private_route_table_association_ids         = [
          + (known after apply),
          + (known after apply),
          + (known after apply),
        ]
      + private_route_table_ids                     = [
          + (known after apply),
          + (known after apply),
          + (known after apply),
        ]
      + private_subnet_arns                         = [
          + (known after apply),
          + (known after apply),
          + (known after apply),
        ]
      + private_subnets                             = [
          + (known after apply),
          + (known after apply),
          + (known after apply),
        ]
      + private_subnets_cidr_blocks                 = [
          + "10.0.10.0/24",
          + "10.0.11.0/24",
          + "10.0.12.0/24",
        ]
      + private_subnets_ipv6_cidr_blocks            = [
          + null,
          + null,
          + null,
        ]
      + public_internet_gateway_ipv6_route_id       = ""
      + public_internet_gateway_route_id            = (known after apply)
      + public_network_acl_arn                      = ""
      + public_network_acl_id                       = ""
      + public_route_table_association_ids          = [
          + (known after apply),
          + (known after apply),
          + (known after apply),
        ]
      + public_route_table_ids                      = [
          + (known after apply),
        ]
      + public_subnet_arns                          = [
          + (known after apply),
          + (known after apply),
          + (known after apply),
        ]
      + public_subnets                              = [
          + (known after apply),
          + (known after apply),
          + (known after apply),
        ]
      + public_subnets_cidr_blocks                  = [
          + "10.0.0.0/24",
          + "10.0.1.0/24",
          + "10.0.2.0/24",
        ]
      + public_subnets_ipv6_cidr_blocks             = [
          + null,
          + null,
          + null,
        ]
      + redshift_network_acl_arn                    = ""
      + redshift_network_acl_id                     = ""
      + redshift_public_route_table_association_ids = []
      + redshift_route_table_association_ids        = []
      + redshift_route_table_ids                    = [
          + (known after apply),
          + (known after apply),
          + (known after apply),
        ]
      + redshift_subnet_arns                        = []
      + redshift_subnet_group                       = ""
      + redshift_subnets                            = []
      + redshift_subnets_cidr_blocks                = []
      + redshift_subnets_ipv6_cidr_blocks           = []
      + this_customer_gateway                       = {}
      + vgw_arn                                     = ""
      + vgw_id                                      = ""
      + vpc_arn                                     = (known after apply)
      + vpc_cidr_block                              = "10.0.0.0/16"
      + vpc_enable_dns_hostnames                    = true
      + vpc_enable_dns_support                      = true
      + vpc_flow_log_cloudwatch_iam_role_arn        = ""
      + vpc_flow_log_destination_arn                = ""
      + vpc_flow_log_destination_type               = "cloud-watch-logs"
      + vpc_flow_log_id                             = ""
      + vpc_id                                      = (known after apply)
      + vpc_instance_tenancy                        = "default"
      + vpc_ipv6_association_id                     = (known after apply)
      + vpc_ipv6_cidr_block                         = (known after apply)
      + vpc_main_route_table_id                     = (known after apply)
      + vpc_owner_id                                = (known after apply)
      + vpc_secondary_cidr_blocks                   = []
    }
random_string.suffix: Creating...
random_string.suffix: Creation complete after 0s [id=Sewx23EM]
module.vpc.aws_vpc.this[0]: Creating...
module.vpc.aws_vpc.this[0]: Still creating... [10s elapsed]
module.vpc.aws_vpc.this[0]: Still creating... [20s elapsed]
module.vpc.aws_vpc.this[0]: Creation complete after 21s [id=vpc-03634f7ce46ccd223]
module.vpc.aws_route_table.private[2]: Creating...
module.vpc.aws_route_table.private[0]: Creating...
module.vpc.aws_subnet.public[0]: Creating...
module.vpc.aws_route_table.public[0]: Creating...
module.vpc.aws_subnet.private[1]: Creating...
module.vpc.aws_subnet.public[1]: Creating...
module.vpc.aws_subnet.private[2]: Creating...
module.vpc.aws_subnet.private[0]: Creating...
module.vpc.aws_internet_gateway.this[0]: Creating...
module.vpc.aws_subnet.public[2]: Creating...
module.vpc.aws_route_table.public[0]: Creation complete after 2s [id=rtb-003a93abdb3ae6e10]
module.vpc.aws_route_table.private[0]: Creation complete after 2s [id=rtb-07ce4fc9535712d1c]
module.vpc.aws_route_table.private[1]: Creating...
module.vpc.aws_route_table.private[2]: Creation complete after 2s [id=rtb-0a539ce25ae46bb51]
module.vpc.aws_subnet.private[2]: Creation complete after 3s [id=subnet-0bc1e0a3fb807d716]
module.vpc.aws_subnet.private[1]: Creation complete after 3s [id=subnet-01b8a58c7cbb2d825]
module.vpc.aws_subnet.private[0]: Creation complete after 3s [id=subnet-0467c4cca1d205cbb]
module.vpc.aws_internet_gateway.this[0]: Creation complete after 3s [id=igw-07f7113a8ba31ccc6]
module.vpc.aws_route.public_internet_gateway[0]: Creating...
module.vpc.aws_route_table.private[1]: Creation complete after 2s [id=rtb-0d48e6a22b3132ca8]
module.vpc.aws_route_table_association.private[2]: Creating...
module.vpc.aws_route_table_association.private[0]: Creating...
module.vpc.aws_route_table_association.private[1]: Creating...
module.vpc.aws_route_table_association.private[2]: Creation complete after 3s [id=rtbassoc-069831aabca7b9738]
module.vpc.aws_route.public_internet_gateway[0]: Creation complete after 4s [id=r-rtb-003a93abdb3ae6e101080289494]
module.vpc.aws_route_table_association.private[0]: Creation complete after 3s [id=rtbassoc-03bd21b21e05f4d0e]
module.vpc.aws_route_table_association.private[1]: Creation complete after 3s [id=rtbassoc-0849b8ed69bc383db]
module.vpc.aws_subnet.public[1]: Still creating... [10s elapsed]
module.vpc.aws_subnet.public[0]: Still creating... [10s elapsed]
module.vpc.aws_subnet.public[2]: Still creating... [10s elapsed]
module.vpc.aws_subnet.public[0]: Creation complete after 14s [id=subnet-050f68a1b53b7f724]
module.vpc.aws_subnet.public[1]: Creation complete after 14s [id=subnet-0a79767c4f192af1d]
module.vpc.aws_subnet.public[2]: Creation complete after 14s [id=subnet-09f397997ffed9f8a]
module.vpc.aws_route_table_association.public[2]: Creating...
module.vpc.aws_route_table_association.public[0]: Creating...
module.vpc.aws_route_table_association.public[1]: Creating...
module.vpc.aws_route_table_association.public[0]: Creation complete after 3s [id=rtbassoc-0a5559452f1988883]
module.vpc.aws_route_table_association.public[2]: Creation complete after 3s [id=rtbassoc-0a1f9b7425da4b44c]
module.vpc.aws_route_table_association.public[1]: Creation complete after 3s [id=rtbassoc-09fba319f3aabf4da]

Apply complete! Resources: 20 added, 0 changed, 0 destroyed.

Outputs:

cluster_name = "test-eks-Sewx23EM"
region = "eu-west-1"
vpc = {
  "azs" = tolist([
    "eu-west-1a",
    "eu-west-1b",
    "eu-west-1c",
  ])
  "cgw_arns" = []
  "cgw_ids" = []
  "database_internet_gateway_route_id" = ""
  "database_ipv6_egress_route_id" = ""
  "database_nat_gateway_route_ids" = []
  "database_network_acl_arn" = ""
  "database_network_acl_id" = ""
  "database_route_table_association_ids" = []
  "database_route_table_ids" = tolist([
    "rtb-07ce4fc9535712d1c",
    "rtb-0d48e6a22b3132ca8",
    "rtb-0a539ce25ae46bb51",
  ])
  "database_subnet_arns" = []
  "database_subnet_group" = ""
  "database_subnet_group_name" = ""
  "database_subnets" = []
  "database_subnets_cidr_blocks" = []
  "database_subnets_ipv6_cidr_blocks" = []
  "default_network_acl_id" = "acl-0671f1932e27551dc"
  "default_route_table_id" = "rtb-0ce9c96d81ef675b7"
  "default_security_group_id" = "sg-0c2350fa47ddac751"
  "default_vpc_arn" = ""
  "default_vpc_cidr_block" = ""
  "default_vpc_default_network_acl_id" = ""
  "default_vpc_default_route_table_id" = ""
  "default_vpc_default_security_group_id" = ""
  "default_vpc_enable_dns_hostnames" = ""
  "default_vpc_enable_dns_support" = ""
  "default_vpc_id" = ""
  "default_vpc_instance_tenancy" = ""
  "default_vpc_main_route_table_id" = ""
  "dhcp_options_id" = ""
  "egress_only_internet_gateway_id" = ""
  "elasticache_network_acl_arn" = ""
  "elasticache_network_acl_id" = ""
  "elasticache_route_table_association_ids" = []
  "elasticache_route_table_ids" = tolist([
    "rtb-07ce4fc9535712d1c",
    "rtb-0d48e6a22b3132ca8",
    "rtb-0a539ce25ae46bb51",
  ])
  "elasticache_subnet_arns" = []
  "elasticache_subnet_group" = ""
  "elasticache_subnet_group_name" = ""
  "elasticache_subnets" = []
  "elasticache_subnets_cidr_blocks" = []
  "elasticache_subnets_ipv6_cidr_blocks" = []
  "igw_arn" = "arn:aws:ec2:eu-west-1:645945852371:internet-gateway/igw-07f7113a8ba31ccc6"
  "igw_id" = "igw-07f7113a8ba31ccc6"
  "intra_network_acl_arn" = ""
  "intra_network_acl_id" = ""
  "intra_route_table_association_ids" = []
  "intra_route_table_ids" = []
  "intra_subnet_arns" = []
  "intra_subnets" = []
  "intra_subnets_cidr_blocks" = []
  "intra_subnets_ipv6_cidr_blocks" = []
  "name" = "bootstrap-example"
  "nat_ids" = []
  "nat_public_ips" = tolist([])
  "natgw_ids" = []
  "outpost_network_acl_arn" = ""
  "outpost_network_acl_id" = ""
  "outpost_subnet_arns" = []
  "outpost_subnets" = []
  "outpost_subnets_cidr_blocks" = []
  "outpost_subnets_ipv6_cidr_blocks" = []
  "private_ipv6_egress_route_ids" = []
  "private_nat_gateway_route_ids" = []
  "private_network_acl_arn" = ""
  "private_network_acl_id" = ""
  "private_route_table_association_ids" = [
    "rtbassoc-03bd21b21e05f4d0e",
    "rtbassoc-0849b8ed69bc383db",
    "rtbassoc-069831aabca7b9738",
  ]
  "private_route_table_ids" = [
    "rtb-07ce4fc9535712d1c",
    "rtb-0d48e6a22b3132ca8",
    "rtb-0a539ce25ae46bb51",
  ]
  "private_subnet_arns" = [
    "arn:aws:ec2:eu-west-1:645945852371:subnet/subnet-0467c4cca1d205cbb",
    "arn:aws:ec2:eu-west-1:645945852371:subnet/subnet-01b8a58c7cbb2d825",
    "arn:aws:ec2:eu-west-1:645945852371:subnet/subnet-0bc1e0a3fb807d716",
  ]
  "private_subnets" = [
    "subnet-0467c4cca1d205cbb",
    "subnet-01b8a58c7cbb2d825",
    "subnet-0bc1e0a3fb807d716",
  ]
  "private_subnets_cidr_blocks" = [
    "10.0.10.0/24",
    "10.0.11.0/24",
    "10.0.12.0/24",
  ]
  "private_subnets_ipv6_cidr_blocks" = [
    tostring(null),
    tostring(null),
    tostring(null),
  ]
  "public_internet_gateway_ipv6_route_id" = ""
  "public_internet_gateway_route_id" = "r-rtb-003a93abdb3ae6e101080289494"
  "public_network_acl_arn" = ""
  "public_network_acl_id" = ""
  "public_route_table_association_ids" = [
    "rtbassoc-0a5559452f1988883",
    "rtbassoc-09fba319f3aabf4da",
    "rtbassoc-0a1f9b7425da4b44c",
  ]
  "public_route_table_ids" = [
    "rtb-003a93abdb3ae6e10",
  ]
  "public_subnet_arns" = [
    "arn:aws:ec2:eu-west-1:645945852371:subnet/subnet-050f68a1b53b7f724",
    "arn:aws:ec2:eu-west-1:645945852371:subnet/subnet-0a79767c4f192af1d",
    "arn:aws:ec2:eu-west-1:645945852371:subnet/subnet-09f397997ffed9f8a",
  ]
  "public_subnets" = [
    "subnet-050f68a1b53b7f724",
    "subnet-0a79767c4f192af1d",
    "subnet-09f397997ffed9f8a",
  ]
  "public_subnets_cidr_blocks" = [
    "10.0.0.0/24",
    "10.0.1.0/24",
    "10.0.2.0/24",
  ]
  "public_subnets_ipv6_cidr_blocks" = [
    tostring(null),
    tostring(null),
    tostring(null),
  ]
  "redshift_network_acl_arn" = ""
  "redshift_network_acl_id" = ""
  "redshift_public_route_table_association_ids" = []
  "redshift_route_table_association_ids" = []
  "redshift_route_table_ids" = tolist([
    "rtb-07ce4fc9535712d1c",
    "rtb-0d48e6a22b3132ca8",
    "rtb-0a539ce25ae46bb51",
  ])
  "redshift_subnet_arns" = []
  "redshift_subnet_group" = ""
  "redshift_subnets" = []
  "redshift_subnets_cidr_blocks" = []
  "redshift_subnets_ipv6_cidr_blocks" = []
  "this_customer_gateway" = {}
  "vgw_arn" = ""
  "vgw_id" = ""
  "vpc_arn" = "arn:aws:ec2:eu-west-1:645945852371:vpc/vpc-03634f7ce46ccd223"
  "vpc_cidr_block" = "10.0.0.0/16"
  "vpc_enable_dns_hostnames" = true
  "vpc_enable_dns_support" = true
  "vpc_flow_log_cloudwatch_iam_role_arn" = ""
  "vpc_flow_log_destination_arn" = ""
  "vpc_flow_log_destination_type" = "cloud-watch-logs"
  "vpc_flow_log_id" = ""
  "vpc_id" = "vpc-03634f7ce46ccd223"
  "vpc_instance_tenancy" = "default"
  "vpc_ipv6_association_id" = ""
  "vpc_ipv6_cidr_block" = ""
  "vpc_main_route_table_id" = "rtb-0ce9c96d81ef675b7"
  "vpc_owner_id" = "645945852371"
  "vpc_secondary_cidr_blocks" = []
}
bmogilefsky@rocinante-w10:~/Documents/Code/eks-brokerpak/terraform/provision/test/terraform-aws-eks-17.20.0/examples/_bootstrap$ cd ../fargate/
bmogilefsky@rocinante-w10:~/Documents/Code/eks-brokerpak/terraform/provision/test/terraform-aws-eks-17.20.0/examples/fargate$ terraform init
Initializing modules...
- barebone_eks in ../..
- barebone_eks.fargate in ../../modules/fargate
- barebone_eks.node_groups in ../../modules/node_groups
- eks in ../..
- eks.fargate in ../../modules/fargate
- eks.node_groups in ../../modules/node_groups
- fargate_profile_existing_cluster in ../../modules/fargate

Initializing the backend...

Initializing provider plugins...
- terraform.io/builtin/terraform is built in to Terraform
- Finding terraform-aws-modules/http versions matching ">= 2.4.1"...
- Finding hashicorp/kubernetes versions matching ">= 1.11.0, >= 1.11.1"...
- Finding hashicorp/aws versions matching ">= 3.22.0, >= 3.40.0, >= 3.56.0"...
- Finding hashicorp/local versions matching ">= 1.4.0"...
- Finding hashicorp/random versions matching ">= 2.1.0"...
- Finding hashicorp/cloudinit versions matching ">= 2.0.0"...
- Installing hashicorp/local v2.1.0...
- Installed hashicorp/local v2.1.0 (signed by HashiCorp)
- Installing hashicorp/random v3.1.0...
- Installed hashicorp/random v3.1.0 (signed by HashiCorp)
- Installing hashicorp/cloudinit v2.2.0...
- Installed hashicorp/cloudinit v2.2.0 (signed by HashiCorp)
- Installing terraform-aws-modules/http v2.4.1...
- Installed terraform-aws-modules/http v2.4.1 (self-signed, key ID B2C1C0641B6B0EB7)
- Installing hashicorp/kubernetes v2.5.0...
- Installed hashicorp/kubernetes v2.5.0 (signed by HashiCorp)
- Installing hashicorp/aws v3.61.0...
- Installed hashicorp/aws v3.61.0 (signed by HashiCorp)

Partner and community providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://www.terraform.io/docs/cli/plugins/signing.html

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
bmogilefsky@rocinante-w10:~/Documents/Code/eks-brokerpak/terraform/provision/test/terraform-aws-eks-17.20.0/examples/fargate$ terraform version
Terraform v1.0.8
on linux_amd64
+ provider registry.terraform.io/hashicorp/aws v3.61.0
+ provider registry.terraform.io/hashicorp/cloudinit v2.2.0
+ provider registry.terraform.io/hashicorp/kubernetes v2.5.0
+ provider registry.terraform.io/hashicorp/local v2.1.0
+ provider registry.terraform.io/hashicorp/random v3.1.0
+ provider registry.terraform.io/terraform-aws-modules/http v2.4.1
bmogilefsky@rocinante-w10:~/Documents/Code/eks-brokerpak/terraform/provision/test/terraform-aws-eks-17.20.0/examples/fargate$ terraform apply

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_eks_cluster.barebone will be read during apply
  # (config refers to values not yet known)
 <= data "aws_eks_cluster" "barebone"  {
      + arn                       = (known after apply)
      + certificate_authority     = (known after apply)
      + created_at                = (known after apply)
      + enabled_cluster_log_types = (known after apply)
      + endpoint                  = (known after apply)
      + id                        = (known after apply)
      + identity                  = (known after apply)
      + kubernetes_network_config = (known after apply)
      + name                      = (known after apply)
      + platform_version          = (known after apply)
      + role_arn                  = (known after apply)
      + status                    = (known after apply)
      + tags                      = (known after apply)
      + version                   = (known after apply)
      + vpc_config                = (known after apply)
    }

  # data.aws_eks_cluster.cluster will be read during apply
  # (config refers to values not yet known)
 <= data "aws_eks_cluster" "cluster"  {
      + arn                       = (known after apply)
      + certificate_authority     = (known after apply)
      + created_at                = (known after apply)
      + enabled_cluster_log_types = (known after apply)
      + endpoint                  = (known after apply)
      + id                        = (known after apply)
      + identity                  = (known after apply)
      + kubernetes_network_config = (known after apply)
      + name                      = (known after apply)
      + platform_version          = (known after apply)
      + role_arn                  = (known after apply)
      + status                    = (known after apply)
      + tags                      = (known after apply)
      + version                   = (known after apply)
      + vpc_config                = (known after apply)
    }

  # data.aws_eks_cluster_auth.barebone will be read during apply
  # (config refers to values not yet known)
 <= data "aws_eks_cluster_auth" "barebone"  {
      + id    = (known after apply)
      + name  = (known after apply)
      + token = (sensitive value)
    }

  # data.aws_eks_cluster_auth.cluster will be read during apply
  # (config refers to values not yet known)
 <= data "aws_eks_cluster_auth" "cluster"  {
      + id    = (known after apply)
      + name  = (known after apply)
      + token = (sensitive value)
    }

  # module.barebone_eks.data.http.wait_for_cluster[0] will be read during apply
  # (config refers to values not yet known)
 <= data "http" "wait_for_cluster"  {
      + body             = (known after apply)
      + ca_certificate   = (known after apply)
      + id               = (known after apply)
      + response_headers = (known after apply)
      + timeout          = 300
      + url              = (known after apply)
    }

  # module.barebone_eks.aws_eks_cluster.this[0] will be created
  + resource "aws_eks_cluster" "this" {
      + arn                   = (known after apply)
      + certificate_authority = (known after apply)
      + created_at            = (known after apply)
      + endpoint              = (known after apply)
      + id                    = (known after apply)
      + identity              = (known after apply)
      + name                  = "barebone-test-eks-Sewx23EM"
      + platform_version      = (known after apply)
      + role_arn              = (known after apply)
      + status                = (known after apply)
      + tags                  = {
          + "Barebone"    = "yes_please"
          + "Environment" = "test"
        }
      + tags_all              = {
          + "Barebone"    = "yes_please"
          + "Environment" = "test"
        }
      + version               = "1.21"

      + kubernetes_network_config {
          + service_ipv4_cidr = (known after apply)
        }

      + timeouts {
          + create = "30m"
          + delete = "15m"
          + update = "60m"
        }

      + vpc_config {
          + cluster_security_group_id = (known after apply)
          + endpoint_private_access   = false
          + endpoint_public_access    = true
          + public_access_cidrs       = [
              + "0.0.0.0/0",
            ]
          + security_group_ids        = (known after apply)
          + subnet_ids                = [
              + "subnet-01b8a58c7cbb2d825",
              + "subnet-0467c4cca1d205cbb",
              + "subnet-0bc1e0a3fb807d716",
            ]
          + vpc_id                    = (known after apply)
        }
    }

  # module.barebone_eks.aws_iam_policy.cluster_elb_sl_role_creation[0] will be created
  + resource "aws_iam_policy" "cluster_elb_sl_role_creation" {
      + arn         = (known after apply)
      + description = "Permissions for EKS to create AWSServiceRoleForElasticLoadBalancing service-linked role"
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = "barebone-test-eks-Sewx23EM-elb-sl-role-creation"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ec2:DescribeInternetGateways",
                          + "ec2:DescribeAddresses",
                          + "ec2:DescribeAccountAttributes",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags        = {
          + "Barebone"    = "yes_please"
          + "Environment" = "test"
        }
      + tags_all    = {
          + "Barebone"    = "yes_please"
          + "Environment" = "test"
        }
    }

  # module.barebone_eks.aws_iam_role.cluster[0] will be created
  + resource "aws_iam_role" "cluster" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "eks.amazonaws.com"
                        }
                      + Sid       = "EKSClusterAssumeRole"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "barebone-test-eks-Sewx23EM"
      + path                  = "/"
      + tags                  = {
          + "Barebone"    = "yes_please"
          + "Environment" = "test"
        }
      + tags_all              = {
          + "Barebone"    = "yes_please"
          + "Environment" = "test"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.barebone_eks.aws_iam_role.workers[0] will be created
  + resource "aws_iam_role" "workers" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                      + Sid       = "EKSWorkerAssumeRole"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "barebone-test-eks-Sewx23EM"
      + path                  = "/"
      + tags                  = {
          + "Barebone"    = "yes_please"
          + "Environment" = "test"
        }
      + tags_all              = {
          + "Barebone"    = "yes_please"
          + "Environment" = "test"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.barebone_eks.aws_iam_role_policy_attachment.cluster_AmazonEKSClusterPolicy[0] will be created
  + resource "aws_iam_role_policy_attachment" "cluster_AmazonEKSClusterPolicy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"
      + role       = (known after apply)
    }

  # module.barebone_eks.aws_iam_role_policy_attachment.cluster_AmazonEKSServicePolicy[0] will be created
  + resource "aws_iam_role_policy_attachment" "cluster_AmazonEKSServicePolicy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSServicePolicy"
      + role       = (known after apply)
    }

  # module.barebone_eks.aws_iam_role_policy_attachment.cluster_AmazonEKSVPCResourceControllerPolicy[0] will be created
  + resource "aws_iam_role_policy_attachment" "cluster_AmazonEKSVPCResourceControllerPolicy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSVPCResourceController"
      + role       = (known after apply)
    }

  # module.barebone_eks.aws_iam_role_policy_attachment.cluster_elb_sl_role_creation[0] will be created
  + resource "aws_iam_role_policy_attachment" "cluster_elb_sl_role_creation" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = (known after apply)
    }

  # module.barebone_eks.aws_iam_role_policy_attachment.workers_AmazonEC2ContainerRegistryReadOnly[0] will be created
  + resource "aws_iam_role_policy_attachment" "workers_AmazonEC2ContainerRegistryReadOnly" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"
      + role       = (known after apply)
    }

  # module.barebone_eks.aws_iam_role_policy_attachment.workers_AmazonEKSWorkerNodePolicy[0] will be created
  + resource "aws_iam_role_policy_attachment" "workers_AmazonEKSWorkerNodePolicy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"
      + role       = (known after apply)
    }

  # module.barebone_eks.aws_iam_role_policy_attachment.workers_AmazonEKS_CNI_Policy[0] will be created
  + resource "aws_iam_role_policy_attachment" "workers_AmazonEKS_CNI_Policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"
      + role       = (known after apply)
    }

  # module.barebone_eks.aws_security_group.cluster[0] will be created
  + resource "aws_security_group" "cluster" {
      + arn                    = (known after apply)
      + description            = "EKS cluster security group."
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "barebone-test-eks-Sewx23EM"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Barebone"    = "yes_please"
          + "Environment" = "test"
          + "Name"        = "barebone-test-eks-Sewx23EM-eks_cluster_sg"
        }
      + tags_all               = {
          + "Barebone"    = "yes_please"
          + "Environment" = "test"
          + "Name"        = "barebone-test-eks-Sewx23EM-eks_cluster_sg"
        }
      + vpc_id                 = "vpc-03634f7ce46ccd223"
    }

  # module.barebone_eks.aws_security_group.workers[0] will be created
  + resource "aws_security_group" "workers" {
      + arn                    = (known after apply)
      + description            = "Security group for all nodes in the cluster."
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "barebone-test-eks-Sewx23EM"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Barebone"                                         = "yes_please"
          + "Environment"                                      = "test"
          + "Name"                                             = "barebone-test-eks-Sewx23EM-eks_worker_sg"
          + "kubernetes.io/cluster/barebone-test-eks-Sewx23EM" = "owned"
        }
      + tags_all               = {
          + "Barebone"                                         = "yes_please"
          + "Environment"                                      = "test"
          + "Name"                                             = "barebone-test-eks-Sewx23EM-eks_worker_sg"
          + "kubernetes.io/cluster/barebone-test-eks-Sewx23EM" = "owned"
        }
      + vpc_id                 = "vpc-03634f7ce46ccd223"
    }

  # module.barebone_eks.aws_security_group_rule.cluster_egress_internet[0] will be created
  + resource "aws_security_group_rule" "cluster_egress_internet" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Allow cluster egress access to the Internet."
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # module.barebone_eks.aws_security_group_rule.cluster_https_worker_ingress[0] will be created
  + resource "aws_security_group_rule" "cluster_https_worker_ingress" {
      + description              = "Allow pods to communicate with the EKS cluster API."
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # module.barebone_eks.aws_security_group_rule.workers_egress_internet[0] will be created
  + resource "aws_security_group_rule" "workers_egress_internet" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Allow nodes all egress to the Internet."
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # module.barebone_eks.aws_security_group_rule.workers_ingress_cluster[0] will be created
  + resource "aws_security_group_rule" "workers_ingress_cluster" {
      + description              = "Allow workers pods to receive communication from the cluster control plane."
      + from_port                = 1025
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 65535
      + type                     = "ingress"
    }

  # module.barebone_eks.aws_security_group_rule.workers_ingress_cluster_https[0] will be created
  + resource "aws_security_group_rule" "workers_ingress_cluster_https" {
      + description              = "Allow pods running extension API servers on port 443 to receive communication from cluster control plane."
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # module.barebone_eks.aws_security_group_rule.workers_ingress_self[0] will be created
  + resource "aws_security_group_rule" "workers_ingress_self" {
      + description              = "Allow node to communicate with each other."
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 65535
      + type                     = "ingress"
    }

  # module.barebone_eks.kubernetes_config_map.aws_auth[0] will be created
  + resource "kubernetes_config_map" "aws_auth" {
      + data = {
          + "mapAccounts" = jsonencode([])
          + "mapRoles"    = jsonencode([])
          + "mapUsers"    = jsonencode([])
        }
      + id   = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "app.kubernetes.io/managed-by" = "Terraform"
              + "terraform.io/module"          = "terraform-aws-modules.eks.aws"
            }
          + name             = "aws-auth"
          + namespace        = "kube-system"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.barebone_eks.local_file.kubeconfig[0] will be created
  + resource "local_file" "kubeconfig" {
      + content              = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0600"
      + filename             = "./kubeconfig_barebone-test-eks-Sewx23EM"
      + id                   = (known after apply)
    }

  # module.eks.aws_eks_cluster.this[0] will be created
  + resource "aws_eks_cluster" "this" {
      + arn                   = (known after apply)
      + certificate_authority = (known after apply)
      + created_at            = (known after apply)
      + endpoint              = (known after apply)
      + id                    = (known after apply)
      + identity              = (known after apply)
      + name                  = "test-eks-Sewx23EM"
      + platform_version      = (known after apply)
      + role_arn              = (known after apply)
      + status                = (known after apply)
      + tags                  = {
          + "Environment" = "test"
          + "GithubOrg"   = "terraform-aws-modules"
          + "GithubRepo"  = "terraform-aws-eks"
        }
      + tags_all              = {
          + "Environment" = "test"
          + "GithubOrg"   = "terraform-aws-modules"
          + "GithubRepo"  = "terraform-aws-eks"
        }
      + version               = "1.21"

      + kubernetes_network_config {
          + service_ipv4_cidr = (known after apply)
        }

      + timeouts {
          + create = "30m"
          + delete = "15m"
          + update = "60m"
        }

      + vpc_config {
          + cluster_security_group_id = (known after apply)
          + endpoint_private_access   = false
          + endpoint_public_access    = true
          + public_access_cidrs       = [
              + "0.0.0.0/0",
            ]
          + security_group_ids        = (known after apply)
          + subnet_ids                = [
              + "subnet-0467c4cca1d205cbb",
              + "subnet-0a79767c4f192af1d",
            ]
          + vpc_id                    = (known after apply)
        }
    }

  # module.eks.aws_iam_policy.cluster_elb_sl_role_creation[0] will be created
  + resource "aws_iam_policy" "cluster_elb_sl_role_creation" {
      + arn         = (known after apply)
      + description = "Permissions for EKS to create AWSServiceRoleForElasticLoadBalancing service-linked role"
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = "test-eks-Sewx23EM-elb-sl-role-creation"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ec2:DescribeInternetGateways",
                          + "ec2:DescribeAddresses",
                          + "ec2:DescribeAccountAttributes",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags        = {
          + "Environment" = "test"
          + "GithubOrg"   = "terraform-aws-modules"
          + "GithubRepo"  = "terraform-aws-eks"
        }
      + tags_all    = {
          + "Environment" = "test"
          + "GithubOrg"   = "terraform-aws-modules"
          + "GithubRepo"  = "terraform-aws-eks"
        }
    }

  # module.eks.aws_iam_role.cluster[0] will be created
  + resource "aws_iam_role" "cluster" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "eks.amazonaws.com"
                        }
                      + Sid       = "EKSClusterAssumeRole"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "test-eks-Sewx23EM"
      + path                  = "/"
      + tags                  = {
          + "Environment" = "test"
          + "GithubOrg"   = "terraform-aws-modules"
          + "GithubRepo"  = "terraform-aws-eks"
        }
      + tags_all              = {
          + "Environment" = "test"
          + "GithubOrg"   = "terraform-aws-modules"
          + "GithubRepo"  = "terraform-aws-eks"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.eks.aws_iam_role.workers[0] will be created
  + resource "aws_iam_role" "workers" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                      + Sid       = "EKSWorkerAssumeRole"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "test-eks-Sewx23EM"
      + path                  = "/"
      + tags                  = {
          + "Environment" = "test"
          + "GithubOrg"   = "terraform-aws-modules"
          + "GithubRepo"  = "terraform-aws-eks"
        }
      + tags_all              = {
          + "Environment" = "test"
          + "GithubOrg"   = "terraform-aws-modules"
          + "GithubRepo"  = "terraform-aws-eks"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.eks.aws_iam_role_policy_attachment.cluster_AmazonEKSClusterPolicy[0] will be created
  + resource "aws_iam_role_policy_attachment" "cluster_AmazonEKSClusterPolicy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"
      + role       = (known after apply)
    }

  # module.eks.aws_iam_role_policy_attachment.cluster_AmazonEKSServicePolicy[0] will be created
  + resource "aws_iam_role_policy_attachment" "cluster_AmazonEKSServicePolicy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSServicePolicy"
      + role       = (known after apply)
    }

  # module.eks.aws_iam_role_policy_attachment.cluster_AmazonEKSVPCResourceControllerPolicy[0] will be created
  + resource "aws_iam_role_policy_attachment" "cluster_AmazonEKSVPCResourceControllerPolicy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSVPCResourceController"
      + role       = (known after apply)
    }

  # module.eks.aws_iam_role_policy_attachment.cluster_elb_sl_role_creation[0] will be created
  + resource "aws_iam_role_policy_attachment" "cluster_elb_sl_role_creation" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = (known after apply)
    }

  # module.eks.aws_iam_role_policy_attachment.workers_AmazonEC2ContainerRegistryReadOnly[0] will be created
  + resource "aws_iam_role_policy_attachment" "workers_AmazonEC2ContainerRegistryReadOnly" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"
      + role       = (known after apply)
    }

  # module.eks.aws_iam_role_policy_attachment.workers_AmazonEKSWorkerNodePolicy[0] will be created
  + resource "aws_iam_role_policy_attachment" "workers_AmazonEKSWorkerNodePolicy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"
      + role       = (known after apply)
    }

  # module.eks.aws_iam_role_policy_attachment.workers_AmazonEKS_CNI_Policy[0] will be created
  + resource "aws_iam_role_policy_attachment" "workers_AmazonEKS_CNI_Policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"
      + role       = (known after apply)
    }

  # module.eks.aws_security_group.cluster[0] will be created
  + resource "aws_security_group" "cluster" {
      + arn                    = (known after apply)
      + description            = "EKS cluster security group."
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "test-eks-Sewx23EM"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Environment" = "test"
          + "GithubOrg"   = "terraform-aws-modules"
          + "GithubRepo"  = "terraform-aws-eks"
          + "Name"        = "test-eks-Sewx23EM-eks_cluster_sg"
        }
      + tags_all               = {
          + "Environment" = "test"
          + "GithubOrg"   = "terraform-aws-modules"
          + "GithubRepo"  = "terraform-aws-eks"
          + "Name"        = "test-eks-Sewx23EM-eks_cluster_sg"
        }
      + vpc_id                 = "vpc-03634f7ce46ccd223"
    }

  # module.eks.aws_security_group.workers[0] will be created
  + resource "aws_security_group" "workers" {
      + arn                    = (known after apply)
      + description            = "Security group for all nodes in the cluster."
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "test-eks-Sewx23EM"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Environment"                             = "test"
          + "GithubOrg"                               = "terraform-aws-modules"
          + "GithubRepo"                              = "terraform-aws-eks"
          + "Name"                                    = "test-eks-Sewx23EM-eks_worker_sg"
          + "kubernetes.io/cluster/test-eks-Sewx23EM" = "owned"
        }
      + tags_all               = {
          + "Environment"                             = "test"
          + "GithubOrg"                               = "terraform-aws-modules"
          + "GithubRepo"                              = "terraform-aws-eks"
          + "Name"                                    = "test-eks-Sewx23EM-eks_worker_sg"
          + "kubernetes.io/cluster/test-eks-Sewx23EM" = "owned"
        }
      + vpc_id                 = "vpc-03634f7ce46ccd223"
    }

  # module.eks.aws_security_group_rule.cluster_egress_internet[0] will be created
  + resource "aws_security_group_rule" "cluster_egress_internet" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Allow cluster egress access to the Internet."
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # module.eks.aws_security_group_rule.cluster_https_worker_ingress[0] will be created
  + resource "aws_security_group_rule" "cluster_https_worker_ingress" {
      + description              = "Allow pods to communicate with the EKS cluster API."
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.workers_egress_internet[0] will be created
  + resource "aws_security_group_rule" "workers_egress_internet" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Allow nodes all egress to the Internet."
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # module.eks.aws_security_group_rule.workers_ingress_cluster[0] will be created
  + resource "aws_security_group_rule" "workers_ingress_cluster" {
      + description              = "Allow workers pods to receive communication from the cluster control plane."
      + from_port                = 1025
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 65535
      + type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.workers_ingress_cluster_https[0] will be created
  + resource "aws_security_group_rule" "workers_ingress_cluster_https" {
      + description              = "Allow pods running extension API servers on port 443 to receive communication from cluster control plane."
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.workers_ingress_self[0] will be created
  + resource "aws_security_group_rule" "workers_ingress_self" {
      + description              = "Allow node to communicate with each other."
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 65535
      + type                     = "ingress"
    }

  # module.eks.local_file.kubeconfig[0] will be created
  + resource "local_file" "kubeconfig" {
      + content              = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0600"
      + filename             = "./kubeconfig_test-eks-Sewx23EM"
      + id                   = (known after apply)
    }

  # module.fargate_profile_existing_cluster.aws_eks_fargate_profile.this["profile1"] will be created
  + resource "aws_eks_fargate_profile" "this" {
      + arn                    = (known after apply)
      + cluster_name           = (known after apply)
      + fargate_profile_name   = "profile1"
      + id                     = (known after apply)
      + pod_execution_role_arn = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = [
          + "subnet-01b8a58c7cbb2d825",
          + "subnet-0467c4cca1d205cbb",
        ]
      + tags                   = {
          + "DoYouLoveFargate" = "Yes"
          + "Owner"            = "profile1"
        }
      + tags_all               = {
          + "DoYouLoveFargate" = "Yes"
          + "Owner"            = "profile1"
        }

      + selector {
          + labels    = {
              + "WorkerType" = "fargate"
            }
          + namespace = "profile"
        }
      + selector {
          + labels    = {
              + "k8s-app" = "kube-dns"
            }
          + namespace = "kube-system"
        }
    }

  # module.fargate_profile_existing_cluster.aws_eks_fargate_profile.this["profile2"] will be created
  + resource "aws_eks_fargate_profile" "this" {
      + arn                    = (known after apply)
      + cluster_name           = (known after apply)
      + fargate_profile_name   = "profile2"
      + id                     = (known after apply)
      + pod_execution_role_arn = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = [
          + "subnet-01b8a58c7cbb2d825",
        ]
      + tags                   = {
          + "DoYouLoveFargate" = "Yes"
          + "Owner"            = "profile2"
        }
      + tags_all               = {
          + "DoYouLoveFargate" = "Yes"
          + "Owner"            = "profile2"
        }

      + selector {
          + labels    = {
              + "Fargate" = "profile2"
            }
          + namespace = "default"
        }
    }

  # module.fargate_profile_existing_cluster.aws_iam_role.eks_fargate_pod[0] will be created
  + resource "aws_iam_role" "eks_fargate_pod" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "eks-fargate-pods.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "DoYouLoveFargate" = "Yes"
        }
      + tags_all              = {
          + "DoYouLoveFargate" = "Yes"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.fargate_profile_existing_cluster.aws_iam_role_policy_attachment.eks_fargate_pod[0] will be created
  + resource "aws_iam_role_policy_attachment" "eks_fargate_pod" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSFargatePodExecutionRolePolicy"
      + role       = (known after apply)
    }

  # module.eks.module.fargate.aws_eks_fargate_profile.this["default"] will be created
  + resource "aws_eks_fargate_profile" "this" {
      + arn                    = (known after apply)
      + cluster_name           = "test-eks-Sewx23EM"
      + fargate_profile_name   = "default"
      + id                     = (known after apply)
      + pod_execution_role_arn = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = [
          + "subnet-0bc1e0a3fb807d716",
        ]
      + tags                   = {
          + "Environment" = "test"
          + "GithubOrg"   = "terraform-aws-modules"
          + "GithubRepo"  = "terraform-aws-eks"
          + "Owner"       = "default"
        }
      + tags_all               = {
          + "Environment" = "test"
          + "GithubOrg"   = "terraform-aws-modules"
          + "GithubRepo"  = "terraform-aws-eks"
          + "Owner"       = "default"
        }

      + selector {
          + labels    = {
              + "WorkerType" = "fargate"
            }
          + namespace = "default"
        }
      + selector {
          + labels    = {
              + "k8s-app" = "kube-dns"
            }
          + namespace = "kube-system"
        }
    }

  # module.eks.module.fargate.aws_eks_fargate_profile.this["secondary"] will be created
  + resource "aws_eks_fargate_profile" "this" {
      + arn                    = (known after apply)
      + cluster_name           = "test-eks-Sewx23EM"
      + fargate_profile_name   = "secondary"
      + id                     = (known after apply)
      + pod_execution_role_arn = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = [
          + "subnet-01b8a58c7cbb2d825",
        ]
      + tags                   = {
          + "Environment" = "test"
          + "GithubOrg"   = "terraform-aws-modules"
          + "GithubRepo"  = "terraform-aws-eks"
          + "Owner"       = "secondary"
        }
      + tags_all               = {
          + "Environment" = "test"
          + "GithubOrg"   = "terraform-aws-modules"
          + "GithubRepo"  = "terraform-aws-eks"
          + "Owner"       = "secondary"
        }

      + selector {
          + labels    = {
              + "Environment" = "test"
              + "GithubOrg"   = "terraform-aws-modules"
              + "GithubRepo"  = "terraform-aws-eks"
            }
          + namespace = "default"
        }
    }

  # module.eks.module.fargate.aws_iam_role.eks_fargate_pod[0] will be created
  + resource "aws_iam_role" "eks_fargate_pod" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "eks-fargate-pods.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "test-eks-Sewx23EM-fargate"
      + path                  = "/"
      + tags                  = {
          + "Environment" = "test"
          + "GithubOrg"   = "terraform-aws-modules"
          + "GithubRepo"  = "terraform-aws-eks"
        }
      + tags_all              = {
          + "Environment" = "test"
          + "GithubOrg"   = "terraform-aws-modules"
          + "GithubRepo"  = "terraform-aws-eks"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.eks.module.fargate.aws_iam_role_policy_attachment.eks_fargate_pod[0] will be created
  + resource "aws_iam_role_policy_attachment" "eks_fargate_pod" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSFargatePodExecutionRolePolicy"
      + role       = (known after apply)
    }

Plan: 49 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + cluster_endpoint          = (known after apply)
  + cluster_security_group_id = (known after apply)
  + config_map_aws_auth       = []
  + fargate_profile_arns      = [
      + (known after apply),
      + (known after apply),
    ]
  + kubectl_config            = (known after apply)

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

module.eks.aws_security_group.cluster[0]: Creating...
module.eks.aws_security_group.workers[0]: Creating...
module.barebone_eks.aws_iam_role.cluster[0]: Creating...
module.eks.aws_iam_policy.cluster_elb_sl_role_creation[0]: Creating...
module.barebone_eks.aws_security_group.cluster[0]: Creating...
module.barebone_eks.aws_iam_policy.cluster_elb_sl_role_creation[0]: Creating...
module.barebone_eks.aws_security_group.workers[0]: Creating...
module.eks.aws_iam_role.cluster[0]: Creating...
module.barebone_eks.aws_iam_policy.cluster_elb_sl_role_creation[0]: Creation complete after 2s [id=arn:aws:iam::645945852371:policy/barebone-test-eks-Sewx23EM-elb-sl-role-creation20211002044249185900000007]
module.eks.aws_iam_policy.cluster_elb_sl_role_creation[0]: Creation complete after 2s [id=arn:aws:iam::645945852371:policy/test-eks-Sewx23EM-elb-sl-role-creation20211002044249182300000004]
module.barebone_eks.aws_iam_role.cluster[0]: Creation complete after 2s [id=barebone-test-eks-Sewx23EM20211002044249181000000003]
module.barebone_eks.aws_iam_role_policy_attachment.cluster_AmazonEKSServicePolicy[0]: Creating...
module.barebone_eks.aws_iam_role_policy_attachment.cluster_AmazonEKSVPCResourceControllerPolicy[0]: Creating...
module.barebone_eks.aws_iam_role_policy_attachment.cluster_AmazonEKSClusterPolicy[0]: Creating...
module.barebone_eks.aws_iam_role_policy_attachment.cluster_elb_sl_role_creation[0]: Creating...
module.eks.aws_iam_role.cluster[0]: Creation complete after 2s [id=test-eks-Sewx23EM20211002044249189400000008]
module.eks.aws_iam_role_policy_attachment.cluster_AmazonEKSServicePolicy[0]: Creating...
module.eks.aws_iam_role_policy_attachment.cluster_elb_sl_role_creation[0]: Creating...
module.barebone_eks.aws_iam_role_policy_attachment.cluster_elb_sl_role_creation[0]: Creation complete after 1s [id=barebone-test-eks-Sewx23EM20211002044249181000000003-2021100204425139710000000b]
module.barebone_eks.aws_iam_role_policy_attachment.cluster_AmazonEKSServicePolicy[0]: Creation complete after 1s [id=barebone-test-eks-Sewx23EM20211002044249181000000003-2021100204425139650000000a]
module.eks.aws_iam_role_policy_attachment.cluster_AmazonEKSClusterPolicy[0]: Creating...
module.barebone_eks.aws_iam_role_policy_attachment.cluster_AmazonEKSVPCResourceControllerPolicy[0]: Creation complete after 1s [id=barebone-test-eks-Sewx23EM20211002044249181000000003-2021100204425139710000000c]
module.eks.aws_iam_role_policy_attachment.cluster_AmazonEKSVPCResourceControllerPolicy[0]: Creating...
module.barebone_eks.aws_iam_role_policy_attachment.cluster_AmazonEKSClusterPolicy[0]: Creation complete after 1s [id=barebone-test-eks-Sewx23EM20211002044249181000000003-20211002044251391500000009]
module.eks.aws_iam_role_policy_attachment.cluster_elb_sl_role_creation[0]: Creation complete after 1s [id=test-eks-Sewx23EM20211002044249189400000008-2021100204425179990000000e]
module.eks.aws_iam_role_policy_attachment.cluster_AmazonEKSServicePolicy[0]: Creation complete after 1s [id=test-eks-Sewx23EM20211002044249189400000008-2021100204425179520000000d]
module.eks.aws_iam_role_policy_attachment.cluster_AmazonEKSClusterPolicy[0]: Creation complete after 1s [id=test-eks-Sewx23EM20211002044249189400000008-2021100204425214740000000f]
module.eks.aws_iam_role_policy_attachment.cluster_AmazonEKSVPCResourceControllerPolicy[0]: Creation complete after 1s [id=test-eks-Sewx23EM20211002044249189400000008-20211002044252537600000010]
module.barebone_eks.aws_security_group.cluster[0]: Creation complete after 5s [id=sg-095be1d6ab91235a1]
module.barebone_eks.aws_security_group_rule.cluster_egress_internet[0]: Creating...
module.eks.aws_security_group.workers[0]: Creation complete after 5s [id=sg-044dbcc0bea8d3607]
module.eks.aws_security_group_rule.workers_egress_internet[0]: Creating...
module.eks.aws_security_group_rule.workers_ingress_self[0]: Creating...
module.eks.aws_security_group.cluster[0]: Creation complete after 5s [id=sg-02cb46d849de89d02]
module.eks.aws_security_group_rule.cluster_egress_internet[0]: Creating...
module.eks.aws_security_group_rule.workers_ingress_cluster_https[0]: Creating...
module.eks.aws_security_group_rule.cluster_https_worker_ingress[0]: Creating...
module.eks.aws_security_group_rule.workers_ingress_cluster[0]: Creating...
module.barebone_eks.aws_security_group.workers[0]: Creation complete after 5s [id=sg-02b9217b633e29a0a]
module.barebone_eks.aws_security_group_rule.workers_egress_internet[0]: Creating...
module.barebone_eks.aws_security_group_rule.workers_ingress_cluster_https[0]: Creating...
module.barebone_eks.aws_security_group_rule.cluster_https_worker_ingress[0]: Creating...
module.eks.aws_security_group_rule.workers_ingress_self[0]: Creation complete after 3s [id=sgrule-1571818307]
module.barebone_eks.aws_security_group_rule.cluster_egress_internet[0]: Creation complete after 3s [id=sgrule-1054191200]
module.barebone_eks.aws_security_group_rule.workers_ingress_self[0]: Creating...
module.barebone_eks.aws_security_group_rule.workers_ingress_cluster[0]: Creating...
module.eks.aws_security_group_rule.cluster_egress_internet[0]: Creation complete after 3s [id=sgrule-3625814935]
module.barebone_eks.aws_security_group_rule.workers_egress_internet[0]: Creation complete after 3s [id=sgrule-1179055371]
module.eks.aws_security_group_rule.cluster_https_worker_ingress[0]: Creation complete after 5s [id=sgrule-2902579455]
module.barebone_eks.aws_security_group_rule.cluster_https_worker_ingress[0]: Creation complete after 5s [id=sgrule-1205790476]
module.eks.aws_security_group_rule.workers_egress_internet[0]: Creation complete after 5s [id=sgrule-3572097867]
module.barebone_eks.aws_eks_cluster.this[0]: Creating...
module.eks.aws_eks_cluster.this[0]: Creating...
module.barebone_eks.aws_security_group_rule.workers_ingress_cluster_https[0]: Creation complete after 5s [id=sgrule-2588773448]
module.eks.aws_security_group_rule.workers_ingress_cluster[0]: Creation complete after 8s [id=sgrule-2585183791]
module.barebone_eks.aws_security_group_rule.workers_ingress_cluster[0]: Creation complete after 5s [id=sgrule-2571055655]
module.eks.aws_security_group_rule.workers_ingress_cluster_https[0]: Creation complete after 10s [id=sgrule-3720763626]
module.barebone_eks.aws_security_group_rule.workers_ingress_self[0]: Creation complete after 8s [id=sgrule-980853405]
╷
│ Error: error creating EKS Cluster (test-eks-Sewx23EM): ResourceInUseException: Cluster already exists with name: test-eks-Sewx23EM
│ {
│   RespMetadata: {
│     StatusCode: 409,
│     RequestID: "21a01e27-3d8c-45d7-8324-55175e92869c"
│   },
│   ClusterName: "test-eks-Sewx23EM",
│   Message_: "Cluster already exists with name: test-eks-Sewx23EM"
│ }
│ 
│   with module.eks.aws_eks_cluster.this[0],
│   on ../../main.tf line 11, in resource "aws_eks_cluster" "this":
│   11: resource "aws_eks_cluster" "this" {
│ 
╵
╷
│ Error: error creating EKS Cluster (barebone-test-eks-Sewx23EM): ResourceInUseException: Cluster already exists with name: barebone-test-eks-Sewx23EM
│ {
│   RespMetadata: {
│     StatusCode: 409,
│     RequestID: "929811c9-54f7-4b36-93f4-ee048546eaad"
│   },
│   ClusterName: "barebone-test-eks-Sewx23EM",
│   Message_: "Cluster already exists with name: barebone-test-eks-Sewx23EM"
│ }
│ 
│   with module.barebone_eks.aws_eks_cluster.this[0],
│   on ../../main.tf line 11, in resource "aws_eks_cluster" "this":
│   11: resource "aws_eks_cluster" "this" {
│ 

```
</details>

I am utterly baffled. Can you help?

The only thing I can think of is that perhaps this module is sensitive to being run under WSL2 under Windows 10...? 
```
bmogilefsky@rocinante-w10:~/Documents/Code/eks-brokerpak/terraform/provision/test$ uname -a
Linux rocinante-w10 5.10.16.3-microsoft-standard-WSL2 #1 SMP Fri Apr 2 22:23:49 UTC 2021 x86_64 x86_64 x86_64 GNU/Linux
```

A teammate who was trying this code found the same result, also running under WSL2 under Windows 10. I will try to reproduce this problem on my Macbook next.